Revit 2026 API

# WaveWaveWaveLenMin Property

---

The property labeled "Len Min" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaveWaveLenMin { get; }
```
```vb
Public Shared ReadOnly Property WaveWaveLenMin As String
	Get
```
```cpp
public:
static property String^ WaveWaveLenMin {
	String^ get ();
}
```
```fsharp
static member WaveWaveLenMin : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace